electgpl/Firmware-Electronica/8051/8051 C/8051  Estacion Interna Silabs C8051F832.c
   lcdGotoxy(12,2);                                          //Posiciona el cursor en la pantalla
   itoa(datoExt[2],string);                                  //Funcion que convierte entero en ascii
   lcdWriteString(string);                                   //Muestra en el LCD
   lcdGotoxy(15,2);                                          //Posiciona el cursor en la pantalla
   lcdWriteString("L");                                      //Imprime unidad de medida
   lcdGotoxy(3,1);                                           //Posiciona el cursor en la pantalla
   itoa(datoInt[0],string);                                  //Funcion que convierte entero en ascii
   lcdWriteString(string);                                   //Muestra en el LCD
   lcdGotoxy(5,1);                                           //Posiciona el cursor en la pantalla
   lcdWriteString(0xDF);                                     //Imprime unidad de medida
   lcdGotoxy(6,1);                                           //Posiciona el cursor en la pantalla
   lcdWriteString("C");                                      //Imprime unidad de medida
   lcdGotoxy(10,1);                                          //Posiciona el cursor en la pantalla
   itoa(datoInt[1],string);                                  //Funcion que convierte entero en ascii
   lcdWriteString(string);                                   //Muestra en el LCD
   lcdGotoxy(12,1);                                          //Posiciona el cursor en la pantalla
   lcdWriteString("%RH");                                    //Imprime unidad de medida
}
//*********************************************************************************************************
// Programa principal, Realiza la lectura de DHT11, lectura de bateria y recibe los datos por UART
// Lee la temperatura y humedad interna, realiza un pronóstico aproximado
//*********************************************************************************************************
void main(){                                                 //Funcion principal
   saludoPantalla();                                         //Función de saludo de pantalla
   P1=0x00; 																 //Usado para aplicacion
   P3=0x03; 															    //Usado para el serie
   serialInit();                                             //Inicializa puerto serie
   EA=1;                                                     //Habilitacion de interrupcion Global
   ES=1;                                                     //Habilitacion de interrupcion Serie
   while(1){                                                 //Loop principal infinito
      leeDHT11();                                            //Funcion que lee DHT11
      delay_ms(2000);                                        //delay_ms de Actualizacion
      impPantalla();                                         //Imprime pantalla LCD
      delay_ms(2000);                                        //delay_ms de Actualizacion
   }
}
